{
  "teams": [
    {
      "id": 1,
      "displayName": "Sugar Land Space Cowboys",
      "owner": "Ian Schurr",
      "primaryColor": "#FF6B6B",
      "secondaryColor": "#FFF5F5",
      "cityPhotoUrl": "https://img.mlbstatic.com/mlb-images/image/private/t_16x9/t_w2208/mlb/ddb13mpmddzryeufihaf",
      "bio": "The Cowboys are the league's boom-or-bust franchise — two championships (2022, 2024) but a losing overall record, with Jose Ramirez single-handedly carrying the lineup through every season. The highs are as high as it gets: a dominant 17-5 run in 2024 followed by the trophy. The lows are equally dramatic: a 4-18 collapse in 2025 sent them to the Saccko bracket just months after defending their title.",
      "strengths": "When the Cowboys are clicking, nobody in the league can match their ceiling. Jose Ramirez is the most reliably elite anchor in the league — a five-tool fantasy producer who floods every stat category every single week. The championship pedigree is real: two titles in four years shows Ian knows how to build a team that peaks at the right moment. The Cowboys tend to run hot on pitching in championship runs, suggesting Ian is willing to make aggressive waiver and trade moves when it matters most.",
      "weaknesses": "The 4-18 collapse in 2025, coming directly after a 17-5 title run, is the most dramatic single-season fall in league history and points to a structural problem: extreme reliance on one or two elite players with very little depth behind them. When Ramirez cools off or has an injury, there's often nothing to absorb the loss. The Cowboys also appear to run hot and cold on pitching — championship years feature strong arms, but non-competitive years suggest the rotation is largely assembled through the wire rather than built to last."
    },
    {
      "id": 2,
      "displayName": "Portland Chinook",
      "owner": "Owen Hart",
      "primaryColor": "#4ECDC4",
      "secondaryColor": "#F0FFFE",
      "cityPhotoUrl": "https://picsum.photos/seed/portland-or/1600/900",
      "bio": "The Chinook carry the most frustrating stat in the league: a winning 45-40 all-time record with just one playoff appearance to show for it. Freddie Freeman has been their most consistent weapon over the years, and 2023 — their sole postseason appearance — showed what this team can do when everything clicks. Owen's squad remains the league's great unfulfilled promise.",
      "strengths": "The Chinook's 45-40 record is quietly impressive — they beat the majority of teams they face over any given season, which speaks to a genuinely well-balanced roster rather than a squad that just rides star power. Freddie Freeman is one of the most consistent first basemen in fantasy baseball, providing a reliable floor that keeps Portland competitive every single week. Owen tends to avoid the catastrophic collapses that hurt other teams, suggesting smart roster management and a deep enough bench to weather injuries.",
      "weaknesses": "The maddening gap between that 45-40 record and one playoff appearance points to a team that's just good enough to be dangerous but rarely dominant enough to separate. Portland likely lacks the elite upside player who can post a 50-point week and drag the team into the top seeds — they win their share, but don't blow anyone out. Scheduling luck may have also played a cruel role, as a consistently solid team that keeps missing the cut often means they peak in the wrong weeks."
    },
    {
      "id": 3,
      "displayName": "West Virginia Pepperoni Rolls",
      "owner": "Douglas Weimer",
      "primaryColor": "#FFE66D",
      "secondaryColor": "#FFFDE0",
      "cityPhotoUrl": "https://picsum.photos/seed/west-virginia-mountains/1600/900",
      "bio": "The Pepperoni Rolls came out of the gate hot — back-to-back playoff appearances in 2022 and 2023 had this squad looking like a perennial contender. But a steep fall followed, with a 5-17 record and Saccko bracket finish in 2025 raising serious questions about the rebuild. Julio Rodriguez has been the face of the franchise, carrying the offense through good years and bad.",
      "strengths": "The early years of this franchise were genuinely well-constructed — back-to-back playoff appearances in the league's first two seasons required real draft and waiver savvy, and Douglas showed he could build a competitive team from scratch. When Julio Rodriguez is healthy and producing at his ceiling, the Pepperoni Rolls have a legitimate offensive weapon who can carry a lineup through tough stretches. The team has historically shown strong positional depth in the infield.",
      "weaknesses": "The collapse from back-to-back playoffs to a 5-17 Saccko finish in 2025 is a sign of roster aging without enough turnover. The franchise appears to have held onto players too long through decline phases rather than cutting losses early, and the keeper pool may have gotten stale. Julio Rodriguez provides upside but also carries injury and inconsistency risk — when he's off, there hasn't been enough secondary scoring to compensate. Pitching depth looks like the Achilles heel: the rotation may have a solid top-of-staff arm but falls apart by the fourth or fifth starter."
    },
    {
      "id": 4,
      "displayName": "Manhattan Mega Rats",
      "owner": "Caleb Tisdale",
      "primaryColor": "#A8E6CF",
      "secondaryColor": "#F0FFF7",
      "cityPhotoUrl": "https://media.timeout.com/images/106110675/750/422/image.jpg",
      "bio": "No team swings wilder than the Mega Rats — Saccko bracket in 2022, league champions in 2023, a catastrophic 5-17 collapse in 2024, then a scorching 16-6 rebound in 2025. Caleb's team lives and dies by the hot hand, and when Ronald Acuña Jr. is locked in, the Rats are nearly unstoppable. Consistency is the one frontier left to conquer.",
      "strengths": "When Ronald Acuña Jr. is on the field and healthy, this is the scariest roster in the league — he's a genuine 40/40 threat who can single-handedly make the Mega Rats the highest-scoring team any given week. Caleb has shown a real ability to rebuild fast: bouncing from 5-17 to 16-6 in one season requires hitting on waiver adds and making smart trades, and the Rats clearly have that gear. Championship DNA is already in the building.",
      "weaknesses": "The extreme year-to-year volatility — champion one year, Saccko the next — is almost certainly tied to Acuña's health. When he's injured or underperforming, the secondary pieces don't appear deep enough to compensate, causing the entire roster to cratered. The Mega Rats look like a one-superstar team with supporting cast depth that's heavily dependent on the waiver wire rather than sustainable keeper value. Pitching is likely the spot where this roster thins out fastest."
    },
    {
      "id": 6,
      "displayName": "Delmarva Emus",
      "owner": "Ben Pereboom",
      "primaryColor": "#6C5CE7",
      "secondaryColor": "#F0EEFF",
      "cityPhotoUrl": "https://picsum.photos/seed/delmarva-peninsula/1600/900",
      "bio": "The Emus own the league's best all-time record at 48-37 and have made the playoffs three times — yet a championship has remained elusive, which may be the most maddening story in the league. The secret weapon? Shohei Ohtani, who has accumulated nearly 3,000 fantasy points and stands as the single most dominant player in Continental Breakfast Alliance history.",
      "strengths": "Shohei Ohtani is the most valuable fantasy asset in league history, and owning him gives the Emus a positional flex advantage no other team can replicate — he contributes elite hitting numbers while also logging starter innings, effectively giving Ben two first-round players in one roster slot. The league's best all-time record reflects genuinely deep roster construction: this team doesn't just have one star, it fills every position with competence. Ben appears to be an active and smart waiver manager who avoids the prolonged dry spells that hurt other franchises.",
      "weaknesses": "Three playoff appearances without a title is the league's most confounding underachievement. The likely culprit is pitching depth beyond the top arm — the Emus may have a dominant ace but fall off sharply to a rotation that gives back too many points in the back half. There's also a chance that the roster is optimized to survive the regular season comfortably but doesn't have the explosive ceiling needed to run through a playoff bracket, where a single dominant opponent can end the run."
    },
    {
      "id": 7,
      "displayName": "Syracuse Sky Chiefs",
      "owner": "Michael Pugh",
      "primaryColor": "#FDCB6E",
      "secondaryColor": "#FFF9E0",
      "cityPhotoUrl": "https://picsum.photos/seed/syracuse-ny/1600/900",
      "bio": "The Sky Chiefs have had a turbulent journey — a Saccko bracket finish in 2023 gave way to a breakout 2024 in which Michael's squad went 14-8 and posted one of the highest-scoring seasons in league history. Aaron Judge has been the franchise cornerstone, a perennial monster who makes every week a must-watch. The first title feels like a matter of when, not if.",
      "strengths": "Aaron Judge is one of the most explosive HR/RBI producers in all of fantasy baseball, and on a weekly basis few players match his point ceiling. The 14-8 season in 2024 showed this roster is capable of elite production across the board, not just from Judge — the points total that year suggests Michael has built meaningful depth beyond the headline name. The Sky Chiefs appear to be trending up, which is the most dangerous trajectory in keeper leagues.",
      "weaknesses": "The 2023 Saccko finish reveals how much this team depends on Judge staying healthy and hot. When he struggles or sits, the rest of the lineup hasn't shown it can fully compensate — there's a noticeable production cliff after the top two or three contributors. Pitching has historically been the soft underbelly: the rotation likely has one reliable starter but gets inconsistent production from spots three through five, which can be fatal during tough matchup stretches."
    },
    {
      "id": 8,
      "displayName": "Ghent Whistlepigs",
      "owner": "Luke Pontzer",
      "primaryColor": "#74B9FF",
      "secondaryColor": "#EFF8FF",
      "cityPhotoUrl": "https://picsum.photos/seed/ghent-norfolk-virginia/1600/900",
      "bio": "In four seasons, the Whistlepigs have yet to make a single playoff appearance — the only team in the league with that distinction. Luke's squad has shown promise, including a 12-10 record in 2024, but inconsistency and a 2023 Saccko bracket finish have kept them in baseball purgatory. Nico Hoerner has been their most reliable anchor on a team still searching for its identity.",
      "strengths": "The Whistlepigs are trending in the right direction — the 12-10 record in 2024 shows real improvement and suggests Luke is getting better at identifying value on the waiver wire. Nico Hoerner provides a reliable, high-contact infield anchor who won't blow up your week, and the team's overall roster balance has visibly improved season over season. There's something to be said for a franchise that avoids catastrophic collapses while quietly building.",
      "weaknesses": "The absence of a single playoff appearance in four seasons despite a winning record in 2024 points to the core issue: no elite upside piece at the top of the roster. Nico Hoerner is a solid player but not a player who wins you weeks on his own. Without a true first-round-caliber anchor, the Whistlepigs tend to win their fair share but can't separate from the pack when it matters. The 2023 Saccko finish also suggests there's still a fragility in the back of the roster — thin pitching or corner infield depth that collapses under pressure."
    },
    {
      "id": 9,
      "displayName": "North Georgia Fuzzy Bottoms",
      "owner": "Dugan Walker",
      "primaryColor": "#55EFC4",
      "secondaryColor": "#EFFFFA",
      "cityPhotoUrl": "https://picsum.photos/seed/north-georgia-mountains/1600/900",
      "bio": "The Fuzzy Bottoms own the league's worst all-time record at 34-51, and the losses have piled up despite boasting two of the most exciting players in the league — Bobby Witt Jr. and Mookie Betts have combined for nearly 3,000 fantasy points in Dugan's lineup. The talent is undeniable, but a 5-17 record in 2024 remains the painful low point of a franchise still chasing its first playoff berth.",
      "strengths": "Bobby Witt Jr. and Mookie Betts are legitimately elite fantasy assets — both are five-category contributors who can score 40+ points on a given week without breaking a sweat. When both are healthy and clicking, the Fuzzy Bottoms top-end production is competitive with anyone in the league. Dugan clearly has an eye for selecting high-ceiling players, and the raw talent on this roster has never been the question.",
      "weaknesses": "A 34-51 record alongside nearly 3,000 combined points from just two players tells the story: the roster cliff after Witt and Betts is severe. The supporting cast — pitching depth, corner positions, middle relief — appears to consistently underperform, effectively neutralizing the elite top-end talent. The Fuzzy Bottoms may also be too active on the waiver wire, cycling through players quickly and missing out on the accumulation gains that come from holding guys through rough patches. The pattern suggests a roster that looks great on paper at the top and then gives away points everywhere else."
    },
    {
      "id": 10,
      "displayName": "Bristol Banshees",
      "owner": "Jacob Tisdale",
      "primaryColor": "#FD79A8",
      "secondaryColor": "#FFF0F7",
      "cityPhotoUrl": "https://planning-org-uploaded-media.s3.amazonaws.com/image/State-Street-sign.jpg",
      "bio": "The Bristol Banshees arrived in 2025 as the league's newest franchise and immediately made everyone else look foolish — a 13-9 regular season record and a league championship in year one. Built around the generational talent of Juan Soto, Jacob's squad has a ceiling that few teams can match. The Banshees don't have much history yet, but they're already off to a legendary start.",
      "strengths": "Juan Soto is one of the two or three most valuable fantasy players in baseball — elite OBP, consistent power, and a track record of producing even in down years. A league championship in year one is not an accident: Jacob demonstrated real roster construction instincts by surrounding Soto with enough depth to actually win a title rather than just making the bracket. The Banshees entered as an expansion team and immediately competed at the highest level, which suggests strong draft preparation and aggressive waiver management.",
      "weaknesses": "One season of data makes it genuinely hard to identify structural weaknesses — every franchise looks good after winning a championship. The biggest risk is complacency: title rosters often age fast in keeper leagues as other managers target your depth in trades. The Banshees' keeper pool is also the youngest in the league, which means fewer long-term locked-in assets and more roster decisions to make each spring. How Jacob responds to being the hunted rather than the hunter in year two will tell us a lot about whether this is a dynasty in the making or a one-year wonder."
    },
    {
      "id": 11,
      "displayName": "Ft. Meade Folksy Ferrets",
      "owner": "Daniel Nakasone",
      "primaryColor": "#B8860B",
      "secondaryColor": "#FFF8DC",
      "cityPhotoUrl": "https://picsum.photos/seed/fort-meade-maryland/1600/900",
      "bio": "The Folksy Ferrets have been the league's most quietly dangerous team — three playoff appearances, a 47-37 all-time record that ranks second in the league, and a 15-7 breakout in 2025 that signals this squad may be peaking at exactly the right time. Vladimir Guerrero Jr. has been Daniel's franchise cornerstone since day one, logging nearly 2,000 fantasy points and providing the steady production every manager dreams of.",
      "strengths": "Vladimir Guerrero Jr. is the gold standard for first base production — consistent 30+ homer power, elite batting average, and the durability that makes him a set-it-and-forget-it anchor. The Folksy Ferrets' 47-37 record and three playoff appearances reflect the deepest overall roster in the league: this isn't a team propped up by one star, it's a roster where Daniel has built real value from top to bottom. The 15-7 season in 2025 suggests the pitching staff in particular may have finally rounded into form, with multiple reliable starters rather than just one.",
      "weaknesses": "Three playoff appearances without a championship mirrors the Emus' frustration, and the likely explanation is similar: the regular season roster is well-built for consistency but may lack the explosive ceiling needed to dominate a playoff bracket. Vladdy Jr., for all his reliability, isn't a player who regularly posts the monster weeks that can single-handedly carry a team through tough playoff matchups. The Ferrets may also be slightly conservative in their waiver approach — avoiding the implosions that hurt other teams, but also missing the home-run adds that could elevate the floor to a title ceiling."
    }
  ]
}
